code-review/NRB_3471_3546/База_Стало/Reports/РегуляторнаяОтчетность_Форма_0409707_7_0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РегуляторнаяОтчетность_Форма_0409707_7_0</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеИзDiasoft</Name>
					<Comment>Список документов ДанныеИзDiasoft, данные из которых участвуют в формировании отчета</Comment>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПодраздела1_1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатКлиент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусКл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКАТО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолКлиент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПодраздела1_2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСчДЕПО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолСчДЕПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолСчДЕПОполож</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПодраздела1_3</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодВидаОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/AccumulationRegisters/ОстаткиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Депозитарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОПопечителе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МежДепозитарный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ВидыСчетовДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСчетовДепо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетДЕПО</Name>
					<Comment>Счет для учета ценных бумаг</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНФИ</Name>
					<Comment>Счет для учета финансовых инструментов, неклассифицированных как ценные бумаги</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ПризнакиСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПризнакиСчетаДепо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетДепонента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаНалоговыеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченныйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписантОтчетовПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контролер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписантСПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенеральныйДиректор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаОсобыхКлиентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписантВРегуляторнойОтчетности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительВРегуляторнойОтчетности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.МестаХранения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попечитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/РегуляторнаяОтчетность_Форма_0409707_7_0/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура заполняет данными ТЧ ДанныеРаздела1_1
// Параметры:
//	ДанныеДляРасшифровки - ТаблицаЗначений - возвращаемый параметр, в котором возвращается таблица значений
//
// BSLLS:MethodSize-off
Процедура ПолучитьДанные1_1(ДанныеДляРасшифровки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	// Исходим из того, что с одним юридическим/физическим лицом может быть связано несколько контрагентов, но одного
	// контрагента должен быть только один депозитарный договор
	// Также важно что реквизит Резидент в справочнике контрагентов, как это ни парадоксально, означает "Нерезидент по документам"
	// - живите теперь с этим, если не знали раньше
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.Наименование КАК НаименованиеКонтрагента,
	|	Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	Контрагенты.Резидент КАК НеРезидент,
	|	Контрагенты.РегионДляОтчетов КАК РегионДляОтчетов,
	|	КОЛИЧЕСТВО(*) КАК КоличествоДепозитарныхДоговоровУКонтрагента,
	|	МАКСИМУМ(ДоговорыКонтрагентов.ДатаОкончанияДействия) КАК ДатаОкончанияДействияДоговора,
	|	МАКСИМУМ(ДоговорыКонтрагентов.Код) КАК НомерДоговора
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДоговорыКонтрагентов.Владелец = Контрагенты.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.Депозитарный)
	|	И ДоговорыКонтрагентов.ДатаНачалоДействия <= &ПериодКонец
	|	И ВЫБОР
	|			КОГДА ДоговорыКонтрагентов.ДатаОкончанияДействия > &ПериодКонец
	|				ТОГДА ИСТИНА
	|			КОГДА ДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И НЕ Контрагенты.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.Ссылка,
	|	Контрагенты.ЮридическиеФизическиеЛица,
	|	Контрагенты.Резидент,
	|	Контрагенты.РегионДляОтчетов,
	|	Контрагенты.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания КАК МеждународнаяКомпания,
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.ЮридическоеЛицо КАК ЮридическоеЛицо,
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.ПризнакРегистрацииМеждународнойКомпании КАК ПризнакРегистрацииМК
	|ПОМЕСТИТЬ ВТ_МеждународныеКомпании
	|ИЗ
	|	РегистрСведений.ЮридическиеЛицаМеждународныеКомпании.СрезПоследних(
	|			&ПериодКонец,
	|			ЮридическоеЛицо В
	|				(ВЫБРАТЬ
	|					ВТ_Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица
	|				ИЗ
	|					ВТ_Контрагенты КАК ВТ_Контрагенты)) КАК ЮридическиеЛицаМеждународныеКомпанииСрезПоследних
	|ГДЕ
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОбороты.СчетДепо.Владелец КАК Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОстаткиЦБОбороты.Регистратор) КАК КоличествоДокументов
	|ПОМЕСТИТЬ ВТ_КонтрагентыСОборотамиЗаПериод
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Обороты(&ПериодНачало, &ГраницаКонцаПериода, Регистратор, ) КАК ОстаткиЦБОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				ТОГДА НЕ ВЫРАЗИТЬ(ОстаткиЦБОбороты.Регистратор КАК Документ.ОперацииЦБ).ВидОперацииД В (&ИсключаемыеВидыОпераций)
	|			КОГДА ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.ЦБВПути
	|				ТОГДА НЕ ВЫРАЗИТЬ(ОстаткиЦБОбороты.Регистратор КАК Документ.ЦБВПути).ВидОперацииД В (&ИсключаемыеВидыОпераций)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦБОбороты.СчетДепо.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	МАКСИМУМ(ВТ_Контрагенты.НеРезидент) КАК НеРезидент,
	|	МИНИМУМ(ВТ_Контрагенты.НеРезидент) КАК МинНеРезидент,
	|	МАКСИМУМ(ВТ_Контрагенты.РегионДляОтчетов) КАК РегионДляОтчетов,
	|	МИНИМУМ(ВТ_Контрагенты.РегионДляОтчетов) КАК МинРегионДляОтчетов
	|ПОМЕСТИТЬ ВТ_ДанныеЮрФизЛиц
	|ИЗ
	|	ВТ_Контрагенты КАК ВТ_Контрагенты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Контрагенты.ЮридическиеФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Контрагенты.Контрагент КАК Контрагент,
	|	ВТ_Контрагенты.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
	|	ВТ_Контрагенты.НеРезидент КАК Нерезидент,
	|	ВЫБОР
	|		КОГДА ВТ_Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК КатегорияКлиента,
	|	ВЫБОР
	|		КОГДА ВТ_КонтрагентыСОборотамиЗаПериод.КоличествоДокументов ЕСТЬ NULL
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СтатусКлиента,
	|	ВТ_Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическоеФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВТ_Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВТ_Контрагенты.ЮридическиеФизическиеЛица
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЮридическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВТ_Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЮридическиеЛица.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодЮЛ,
	|	ВЫБОР
	|		КОГДА ВТ_Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВТ_Контрагенты.ЮридическиеФизическиеЛица
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВТ_Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ФизическиеЛица.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодФЛ,
	|	ВЫБОР
	|		КОГДА ВТ_Контрагенты.НеРезидент
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ КлассификаторРегионов.КодДляОтчетов6406У ЕСТЬ NULL
	|					ТОГДА КлассификаторРегионов.КодДляОтчетов6406У
	|				ИНАЧЕ ""00""
	|			КОНЕЦ
	|	КОНЕЦ КАК КодРегиона,
	|	ВЫБОР
	|		КОГДА ВТ_Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Контрагенты.НеРезидент
	|						ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, ""999"")
	|					ИНАЧЕ ""643""
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТ_МеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|							И (ВТ_МеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.Инкорпорация))
	|					ТОГДА ""995""
	|				КОГДА ЕСТЬNULL(ВТ_МеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|							И (ВТ_МеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.Редомициляция)
	|								ИЛИ ВТ_МеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.ПустаяСсылка))
	|						ТОГДА ""996""
	|				КОГДА НЕ ВТ_МеждународныеКомпании.ЮридическоеЛицо ЕСТЬ NULL
	|					ТОГДА ""996""
	|				КОГДА ЮридическиеЛица.МеждународнаяОрганизация = ИСТИНА
	|					ТОГДА ""998""
	|				КОГДА НЕ ВТ_Контрагенты.НеРезидент
	|					ТОГДА ""643""
	|				ИНАЧЕ ЕСТЬNULL(КлассификаторСтранМира.Код, ""999"")
	|			КОНЕЦ
	|	КОНЕЦ КАК КодСтраны,
	|	ВЫБОР
	|		КОГДА ВТ_Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Контрагенты.НеРезидент
	|						ТОГДА ""00""
	|					ИНАЧЕ ЕСТЬNULL(КлассификаторРегионов.КодДляОтчетов6406У, ""00"")
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВТ_МеждународныеКомпании.ЮридическоеЛицо ЕСТЬ NULL
	|					ТОГДА ЕСТЬNULL(КлассификаторРегионов.КодДляОтчетов6406У, ""00"")
	|				КОГДА ЮридическиеЛица.МеждународнаяОрганизация = ИСТИНА
	|					ТОГДА ""00""
	|				КОГДА ВТ_Контрагенты.НеРезидент
	|					ТОГДА ""00""
	|				ИНАЧЕ ЕСТЬNULL(КлассификаторРегионов.КодДляОтчетов6406У, ""00"")
	|			КОНЕЦ
	|	КОНЕЦ КАК ОКАТО,
	|	ВТ_Контрагенты.НомерДоговора КАК НомерДоговора,
	|	ВТ_Контрагенты.ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора,
	|	ВТ_КонтрагентыСОборотамиЗаПериод.КоличествоДокументов КАК КоличествоДокументов
	|ПОМЕСТИТЬ ВТ_ДанныеКонтрагентов
	|ИЗ
	|	ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыСОборотамиЗаПериод КАК ВТ_КонтрагентыСОборотамиЗаПериод
	|		ПО ВТ_Контрагенты.Контрагент = ВТ_КонтрагентыСОборотамиЗаПериод.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО ВТ_Контрагенты.РегионДляОтчетов = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторРегионов КАК КлассификаторРегионов
	|		ПО ВТ_Контрагенты.РегионДляОтчетов = КлассификаторРегионов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО ВТ_Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МеждународныеКомпании КАК ВТ_МеждународныеКомпании
	|		ПО ЮридическиеЛица.Ссылка = ВТ_МеждународныеКомпании.ЮридическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ВТ_Контрагенты.ЮридическиеФизическиеЛица = ФизическиеЛица.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеКонтрагентов.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	МАКСИМУМ(ВТ_ДанныеКонтрагентов.КатегорияКлиента) КАК КатегорияКлиента,
	|	МИНИМУМ(ВТ_ДанныеКонтрагентов.СтатусКлиента) КАК СтатусКлиента,
	|	МАКСИМУМ(ВТ_ДанныеКонтрагентов.КодСтраны) КАК КодСтраны,
	|	МАКСИМУМ(ВТ_ДанныеКонтрагентов.ОКАТО) КАК ОКАТО
	|ПОМЕСТИТЬ ВТ_ДанныеКонтрагентовСвернутыеПоЮрФизЛицам
	|ИЗ
	|	ВТ_ДанныеКонтрагентов КАК ВТ_ДанныеКонтрагентов
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеКонтрагентов.ЮридическоеФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Контрагенты.Контрагент КАК Контрагент,
	|	ВТ_Контрагенты.КоличествоДепозитарныхДоговоровУКонтрагента КАК КоличествоДепозитарныхДоговоровУКонтрагента
	|ИЗ
	|	ВТ_Контрагенты КАК ВТ_Контрагенты
	|ГДЕ
	|	ВТ_Контрагенты.КоличествоДепозитарныхДоговоровУКонтрагента > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Данные Юридических / физических лиц
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.Код КАК КодКонтрагента,
	|	ВТ_ДанныеЮрФизЛиц.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеЮрФизЛиц.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоФизЛицо,
	|	ВТ_ДанныеЮрФизЛиц.НеРезидент КАК НеРезидент,
	|	ВТ_ДанныеЮрФизЛиц.МинНеРезидент КАК МинНеРезидент,
	|	ВТ_ДанныеЮрФизЛиц.РегионДляОтчетов КАК РегионДляОтчетов,
	|	ВТ_ДанныеЮрФизЛиц.МинРегионДляОтчетов КАК МинРегионДляОтчетов,
	|	ЕСТЬNULL(КлассификаторСтранМира.Код, КлассификаторРегионов.КодДляОтчетов6406У) КАК КодРегиона
	|ИЗ
	|	ВТ_ДанныеЮрФизЛиц КАК ВТ_ДанныеЮрФизЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_ДанныеЮрФизЛиц.ЮридическиеФизическиеЛица = Контрагенты.ЮридическиеФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.РегионДляОтчетов = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторРегионов КАК КлассификаторРегионов
	|		ПО (Контрагенты.РегионДляОтчетов = КлассификаторРегионов.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ДанныеЮрФизЛиц.ЮридическиеФизическиеЛица.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Расшифровка к разделу 1.1
	|ВЫБРАТЬ
	|	ВТ_ДанныеКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_ДанныеКонтрагентов.НеРезидент КАК Нерезидент,
	|	ВТ_ДанныеКонтрагентов.ЮридическоеЛицо КАК ЮридическоеЛицо,
	|	ВТ_ДанныеКонтрагентов.КодЮЛ КАК КодЮЛ,
	|	ВТ_ДанныеКонтрагентов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ДанныеКонтрагентов.КодФЛ КАК КодФЛ,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.ОКАТО КАК КодРегиона,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.КодСтраны КАК КодСтраны,
	|	ВТ_ДанныеКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДанныеКонтрагентов.ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора,
	|	ВТ_ДанныеКонтрагентов.КоличествоДокументов КАК КоличествоДокументов
	|ИЗ
	|	ВТ_ДанныеКонтрагентов КАК ВТ_ДанныеКонтрагентов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеКонтрагентовСвернутыеПоЮрФизЛицам КАК ДанныеКонтрагентовСвернутыеПоЮрФизЛицам
	|		ПО ВТ_ДанныеКонтрагентов.ЮридическоеФизическоеЛицо = ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.ЮридическоеФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ДанныеКонтрагентов.НаименованиеКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Раздел 1.1
	|ВЫБРАТЬ
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.КатегорияКлиента КАК КатКлиент,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.СтатусКлиента КАК СтатусКл,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.КодСтраны КАК КодСтр,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.ОКАТО КАК ОКАТО,
	|	КОЛИЧЕСТВО(*) КАК КолКлиент
	|ИЗ
	|	ВТ_ДанныеКонтрагентовСвернутыеПоЮрФизЛицам КАК ДанныеКонтрагентовСвернутыеПоЮрФизЛицам
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.КатегорияКлиента,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.СтатусКлиента,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.КодСтраны,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.ОКАТО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.КатегорияКлиента,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.СтатусКлиента,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.КодСтраны,
	|	ДанныеКонтрагентовСвернутыеПоЮрФизЛицам.ОКАТО";
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", ПериодКонец);
	ГраницаКонцаПериода = Новый Граница(КонецДня(ПериодКонец), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ГраницаКонцаПериода", ГраницаКонцаПериода);
	Запрос.УстановитьПараметр("ОтчетнаяДата", ОтчетнаяДата);
	ИсключаемыеВидыОпераций = Новый Массив;
	ИсключаемыеВидыОпераций.Добавить(Справочники.ВидыОпераций.Блокирование);
	ИсключаемыеВидыОпераций.Добавить(Справочники.ВидыОпераций.Разблокирование);
	ИсключаемыеВидыОпераций.Добавить(Справочники.ВидыОпераций.ПередачаВЗалог);
	ИсключаемыеВидыОпераций.Добавить(Справочники.ВидыОпераций.СнятиеОбременения);
	ИсключаемыеВидыОпераций.Добавить(Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	Запрос.УстановитьПараметр("ИсключаемыеВидыОпераций", ИсключаемыеВидыОпераций);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	ИндексПоследнегоЗапроса = РезультатПакета.Количество() - 1;
	ИндексВторогоЗапросаСКонца = ИндексПоследнегоЗапроса - 1;
	ИндексТретьегоЗапросаСКонца = ИндексВторогоЗапросаСКонца - 1;
	ИндексЧетвертогоЗапросаСКонца = ИндексТретьегоЗапросаСКонца - 1;
	
	ДанныеКонтрагентов = РезультатПакета[ИндексЧетвертогоЗапросаСКонца].Выгрузить();
	ПроверитьДанныеКонтрагентов(ДанныеКонтрагентов);
	
	ДанныеЮрФизЛиц = РезультатПакета[ИндексТретьегоЗапросаСКонца].Выгрузить();
	ПроверитьДанныеЮрФизЛиц(ДанныеЮрФизЛиц);
	
	ДанныеДляРасшифровки = РезультатПакета[ИндексВторогоЗапросаСКонца].Выгрузить();
	ДанныеПодраздела1_1.Загрузить(РезультатПакета[ИндексПоследнегоЗапроса].Выгрузить());
КонецПроцедуры
// BSLLS:MethodSize-on

// Процедура заполняет данными ТЧ ДанныеРаздела1_2
// Параметры:
//	ДанныеДляРасшифровки - ТаблицаЗначений - возвращаемый параметр, в котором возвращается таблица значений
Процедура ПолучитьДанные1_2(ДанныеДляРасшифровки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаДепо.Ссылка КАК СчетДепо,
	|	СчетаДепо.Код КАК Код,
	|	СчетаДепо.Владелец КАК ВладелецСчета,
	|	СчетаДепо.ПометкаУдаления КАК ПометкаУдаления,
	|	СчетаДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	СчетаДепо.ВидСчетаДепо КАК ВидСчетаДепо,
	|	СчетаДепо.СтатусСчетаДепо КАК СтатусСчетаДепо
	|ПОМЕСТИТЬ ВТ_ДействующиеСчетаДепо
	|ИЗ
	|	Справочник.СчетаДепо КАК СчетаДепо
	|ГДЕ
	|	СчетаДепо.ДатаОткрытияСчета <= &ПериодКонец
	|	И ВЫБОР
	|			КОГДА СчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт)
	|					И СчетаДепо.ДатаЗакрытияСчета = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА СчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Закрыт)
	|					И СчетаДепо.ДатаЗакрытияСчета > &ПериодКонец
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И СчетаДепо.ВидСчетаДепо <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовДепо.ПустаяСсылка)
	|	И СчетаДепо.ПризнакСчетаДепо = ЗНАЧЕНИЕ(Перечисление.ПризнакиСчетаДепо.СчетДепонента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОбороты.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОбороты.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_СчетаДепоСОстатками
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&ГраницаКонцаПериода,
	|			СчетДепо В
	|				(ВЫБРАТЬ
	|					ВТ_ДействующиеСчетаДепо.СчетДепо КАК СчетДепо
	|				ИЗ
	|					ВТ_ДействующиеСчетаДепо)) КАК ОстаткиЦБОбороты
	|ГДЕ
	|	ОстаткиЦБОбороты.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассификаторДляОтчетовВидыСчетовДЕПО.ТипСчета1С КАК ТипСчета1С,
	|	КлассификаторДляОтчетовВидыСчетовДЕПО.ВидСчетаДляОтчета КАК ВидСчетаДляОтчета
	|ПОМЕСТИТЬ ВТ_КлассификаторДляОтчетов
	|ИЗ
	|	РегистрСведений.КлассификаторДляОтчетовВидыСчетовДЕПО.СрезПоследних(&ПериодКонец, 1 = 1) КАК КлассификаторДляОтчетовВидыСчетовДЕПО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДействующиеСчетаДепо.СчетДепо КАК СчетДепо,
	|	ВТ_ДействующиеСчетаДепо.Код КАК Код,
	|	ВТ_ДействующиеСчетаДепо.ВладелецСчета КАК ВладелецСчета,
	|	ВТ_ДействующиеСчетаДепо.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_ДействующиеСчетаДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ВТ_ДействующиеСчетаДепо.ВидСчетаДепо КАК ВидСчетаДепо,
	|	ВТ_ДействующиеСчетаДепо.СтатусСчетаДепо КАК СтатусСчетаДепо,
	|	ВТ_СчетаДепоСОстатками.КоличествоОстаток КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_КлассификаторДляОтчетов.ВидСчетаДляОтчета, """") КАК ВидСчетаДляОтчета
	|ПОМЕСТИТЬ ВТ_Расшифровка
	|ИЗ
	|	ВТ_ДействующиеСчетаДепо КАК ВТ_ДействующиеСчетаДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаДепоСОстатками КАК ВТ_СчетаДепоСОстатками
	|		ПО ВТ_ДействующиеСчетаДепо.СчетДепо = ВТ_СчетаДепоСОстатками.СчетДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КлассификаторДляОтчетов КАК ВТ_КлассификаторДляОтчетов
	|		ПО ВТ_ДействующиеСчетаДепо.ТипСчетаДепо = ВТ_КлассификаторДляОтчетов.ТипСчета1С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Расшифровка.СчетДепо КАК СчетДепо,
	|	ВТ_Расшифровка.Код КАК КодСчета,
	|	ВТ_Расшифровка.ВладелецСчета КАК ВладелецСчета,
	|	ВТ_Расшифровка.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_Расшифровка.СтатусСчетаДепо КАК СтатусСчетаДепо,
	|	ВТ_Расшифровка.ВидСчетаДепо КАК ВидСчетаДепо,
	|	ВТ_Расшифровка.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ВТ_Расшифровка.ВидСчетаДляОтчета КАК ВидСчетаДляОтчета,
	|	ВТ_Расшифровка.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	ВТ_Расшифровка КАК ВТ_Расшифровка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Расшифровка.ВидСчетаДляОтчета,
	|	ВТ_Расшифровка.ВладелецСчета.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Расшифровка.ВидСчетаДляОтчета КАК ВидСчДЕПО,
	|	КОЛИЧЕСТВО(*) КАК КолСчДЕПО,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Расшифровка.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КолСчДЕПОполож
	|ИЗ
	|	ВТ_Расшифровка КАК ВТ_Расшифровка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Расшифровка.ВидСчетаДляОтчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Расшифровка.ВидСчетаДляОтчета";
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", ПериодКонец);
	ГраницаКонцаПериода = Новый Граница(КонецДня(ПериодКонец), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ГраницаКонцаПериода", ГраницаКонцаПериода);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	ИндексПоследнегоЗапроса = РезультатПакета.Количество() - 1;
	ИндексВторогоЗапросаСКонца = ИндексПоследнегоЗапроса - 1;
	ДанныеДляРасшифровки = РезультатПакета[ИндексВторогоЗапросаСКонца].Выгрузить();
	ПроверитьДанныеСчетовДепо(ДанныеДляРасшифровки);
	ДанныеПодраздела1_2.Загрузить(РезультатПакета[ИндексПоследнегоЗапроса].Выгрузить());
КонецПроцедуры

// Процедура заполняет данными ТЧ ДанныеРаздела1_3
// Параметры:
//	ДанныеДляРасшифровки - ТаблицаЗначений - возвращаемый параметр, в котором возвращается таблица значений
Процедура ПолучитьДанные1_3(ДанныеДляРасшифровки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеИзDiasoft.Ссылка КАК Документ,
	|	ДанныеИзDiasoft.НачалоПериода КАК НачалоПериода,
	|	ДанныеИзDiasoft.КонецПериода КАК КонецПериода
	|ПОМЕСТИТЬ ВТ_Загрузки
	|ИЗ
	|	Документ.ДанныеИзDiasoft КАК ДанныеИзDiasoft
	|ГДЕ
	|	ДанныеИзDiasoft.Ссылка В(&ДокументыЗагрузки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеИзDiasoft.ДокументЗагрузки КАК ДокументЗагрузки,
	|	ДанныеИзDiasoft.НомерДокументаDiasoft КАК НомерДокументаDiasoft,
	|	ДанныеИзDiasoft.ДатаДокументаDiasoft КАК ДатаДокументаDiasoft,
	|	ДанныеИзDiasoft.ВидСуммы КАК ВидСуммы,
	|	ДанныеИзDiasoft.КодВидаОперации КАК КодВидаОперации,
	|	ДанныеИзDiasoft.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ДанныеИзDiasoft
	|ИЗ
	|	РегистрСведений.ДанныеИзDiasoft КАК ДанныеИзDiasoft
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Загрузки КАК ВТ_Загрузки
	|		ПО ДанныеИзDiasoft.ДокументЗагрузки = ВТ_Загрузки.Документ
	|			И (ДанныеИзDiasoft.ДатаДокументаDiasoft МЕЖДУ ВТ_Загрузки.НачалоПериода И ВТ_Загрузки.КонецПериода)
	|			И (ДанныеИзDiasoft.ДатаДокументаDiasoft <= &ПериодКонец)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеИзDiasoft.ДокументЗагрузки КАК ДокументЗагрузки,
	|	ДанныеИзDiasoft.НомерДокументаDiasoft КАК НомерДокументаDiasoft,
	|	ДанныеИзDiasoft.ДатаДокументаDiasoft КАК ДатаДокументаDiasoft,
	|	ДанныеИзDiasoft.ВидСуммы КАК ВидСуммы,
	|	ДанныеИзDiasoft.Сумма КАК Сумма
	|ИЗ
	|	ВТ_ДанныеИзDiasoft КАК ДанныеИзDiasoft
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеИзDiasoft.ДатаДокументаDiasoft,
	|	ДанныеИзDiasoft.ВидСуммы,
	|	ДанныеИзDiasoft.Сумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеИзDiasoft.КодВидаОперации КАК КодВидаОперации,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДанныеИзDiasoft.ВидСуммы = ЗНАЧЕНИЕ(Перечисление.ВидСуммы.ДоходыПоКомиссииЗаДепозитарнуюДеятельность)
	|					ТОГДА ДанныеИзDiasoft.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ЧИСЛО(15, 0)) КАК СуммаДоходов,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДанныеИзDiasoft.ВидСуммы = ЗНАЧЕНИЕ(Перечисление.ВидСуммы.РасходыНаКомиссииЗаДепозитарнуюДеятельность)
	|					ТОГДА ДанныеИзDiasoft.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ЧИСЛО(15, 0)) КАК СуммаРасходов
	|ИЗ
	|	ВТ_ДанныеИзDiasoft КАК ДанныеИзDiasoft
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеИзDiasoft.КодВидаОперации";
	Запрос.УстановитьПараметр("ДокументыЗагрузки", ДанныеИзDiasoft);
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(ПериодКонец));
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	ДанныеПодраздела1_3.Загрузить(ТЗРезультат);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	ИндексПоследнегоЗапроса = РезультатПакета.Количество() - 1;
	ИндексВторогоЗапросаСКонца = ИндексПоследнегоЗапроса - 1;
	ДанныеДляРасшифровки = РезультатПакета[ИндексВторогоЗапросаСКонца].Выгрузить();
	ДанныеПодраздела1_3.Загрузить(РезультатПакета[ИндексПоследнегоЗапроса].Выгрузить());
КонецПроцедуры

// Процедура выгружает сформированный отчет (данные в табличных частях отчета) в XML-файл
Процедура ВыгрузитьВXML() Экспорт
	ИмяФормы = "0409707";
	ПространствоИмен = "urn:cbr-ru:rep0409707:v7.0.4.5";
	
	СхемаXSD = ПолучитьМакет("Ф707_Schema_XSD");
	Фабрика = РегуляторнаяОтчетность.ФабрикаИзСхемыXSD(СхемаXSD);
	Отчетность = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707"));

	УникИдОЭС = Новый УникальныйИдентификатор;
	Отчетность.УникИдОЭС = Строка(УникИдОЭС);	// Пример: "8b91f09d-da8b-11ed-811d-00155d1a3509";
	Отчетность.ВидОтчета = ИмяФормы;
	Отчетность.КодФормы = ИмяФормы;
	Отчетность.ОКУД = ИмяФормы;
	Отчетность.ВидОЭС = "Отчетность КО";
	Отчетность.ВидОтчета = "основной";
	Отчетность.Периодичность = "месячная";
	Отчетность.ДатаВремяФормирования = ТекущаяДатаСеанса();
	// BSLLS:Typo-off
	Отчетность.ОтчДата = ОтчетнаяДата;
	// BSLLS:Typo-on
	
	Отчетность.Составитель = СоставительОтчета(Фабрика, ПространствоИмен);
	
	Отчетность.Данные707 = Данные707(Фабрика, ПространствоИмен);
	
	РегуляторнаяОтчетность.ЗаписатьОтчетностьДляДельтыВXML(Фабрика, Отчетность, ИмяФормы, ПериодНачало, ПериодКонец);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция СоставительОтчета(Фабрика, ПространствоИмен)
	Составитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707Составитель"));
	
	Составитель.Руководитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707СоставительРуководитель"));
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОтветственномЛице(Составитель.Руководитель, Организация,
								Перечисления.ОтветственныеЛицаОрганизаций.ПодписантВРегуляторнойОтчетности, ОтчетнаяДата);
		
	Составитель.Исполнитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707СоставительИсполнитель"));
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОтветственномЛице(Составитель.Исполнитель, Организация,
								Перечисления.ОтветственныеЛицаОрганизаций.ИсполнительВРегуляторнойОтчетности, ОтчетнаяДата);
	
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОрганизации(Составитель, Организация, ОтчетнаяДата);
	
	Возврат Составитель;
КонецФункции

Функция Данные707(Фабрика, ПространствоИмен)
	Данные707 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707Данные707"));
	Данные707.Ид = "1";
	
	Если ДанныеПодраздела1_1.Количество() > 0 Тогда
		Данные707.Подраздел1_1 = Подраздел1_1(Фабрика, ПространствоИмен);
	КонецЕсли;
	
	Если ДанныеПодраздела1_2.Количество() > 0 Тогда
		Данные707.Подраздел1_2 = Подраздел1_2(Фабрика, ПространствоИмен);
	КонецЕсли;
	
	Если ДанныеПодраздела1_3.Количество() > 0 Тогда
		Данные707.Подраздел1_3 = Подраздел1_3(Фабрика, ПространствоИмен);
	КонецЕсли;
	
	Возврат Данные707;
КонецФункции

Функция Подраздел1_1(Фабрика, ПространствоИмен)
	Подраздел1_1 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707Данные707Подраздел1.1"));
	
	Для каждого Данные Из ДанныеПодраздела1_1 Цикл
		
		СтрокаРаздела = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707Данные707Подраздел1.1КолКлиентДД"));
		
		СтрокаРаздела.НомерСтр = Данные.НомерСтроки;
		СтрокаРаздела.ТипКлиента = Данные.КатКлиент;
		СтрокаРаздела.СтатусКл = Данные.СтатусКл;
		СтрокаРаздела.КодСтр = Данные.КодСтр;
		СтрокаРаздела.ОКАТО = Данные.ОКАТО;
		СтрокаРаздела.КолКлиент = Данные.КолКлиент;
		
		Подраздел1_1.КолКлиентДД.Добавить(СтрокаРаздела);
	КонецЦикла;
	
	Возврат Подраздел1_1;
КонецФункции

Функция Подраздел1_2(Фабрика, ПространствоИмен)
	Подраздел1_2 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707Данные707Подраздел1.2"));
	
	Для каждого Данные Из ДанныеПодраздела1_2 Цикл
		
		СтрокаРаздела = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707Данные707Подраздел1.2КолСчДепоДД"));
		
		СтрокаРаздела.НомерСтр = Данные.НомерСтроки;
		СтрокаРаздела.ВидСчДЕПО = Данные.ВидСчДЕПО;
		СтрокаРаздела.КолСчДЕПО = Данные.КолСчДЕПО;
		СтрокаРаздела.КолСчДЕПОполож = Данные.КолСчДЕПОполож;		// BSLLS:Typo-off
		
		Подраздел1_2.КолСчДепоДД.Добавить(СтрокаРаздела);
	КонецЦикла;
	
	Возврат Подраздел1_2;
КонецФункции

Функция Подраздел1_3(Фабрика, ПространствоИмен)
	Подраздел1_3 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707Данные707Подраздел1.3"));
	
	Для каждого Данные Из ДанныеПодраздела1_3 Цикл
		
		СтрокаРаздела = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409707Данные707Подраздел1.3ДохРасхДД"));	// BSLLS:Typo-off
		
		СтрокаРаздела.НомерСтр = Данные.НомерСтроки;
		СтрокаРаздела.ВидОпер = Данные.КодВидаОперации;
		СтрокаРаздела.СуммаКомиссионДох = Данные.СуммаДоходов;	// BSLLS:Typo-off
		СтрокаРаздела.СуммаКомиссионРас = Данные.СуммаРасходов;	// BSLLS:Typo-off
		
		Подраздел1_3.ДохРасхДД.Добавить(СтрокаРаздела);
	КонецЦикла;
	
	Возврат Подраздел1_3;
КонецФункции

Процедура ПроверитьДанныеКонтрагентов(ДанныеКонтрагентов)
	Для каждого Данные Из ДанныеКонтрагентов Цикл
		Если Данные.КоличествоДепозитарныхДоговоровУКонтрагента > 1 Тогда
			ОписаниеОшибки = "У контрагента " + Строка(Данные.Контрагент) + " более одного действующего депозитарного договора на отчетную дату ("
								+ Строка(Данные.КоличествоДепозитарныхДоговоровУКонтрагента) + ")";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеЮрФизЛиц(ДанныеЮрФизЛиц)
	ДопустимыеДлиныОКАТОвФорме707 = Новый Массив;
	ДопустимыеДлиныОКАТОвФорме707.Добавить(2);
	ДопустимыеДлиныОКАТОвФорме707.Добавить(3);
	
	Сущность = "Код региона/страны";
	
	ТекЮрФизЛицо = Неопределено;
	Для каждого Данные Из ДанныеЮрФизЛиц Цикл
		Если ТекЮрФизЛицо <> Данные.ЮридическиеФизическиеЛица Тогда
			Если Данные.ЭтоФизЛицо Тогда
				Принадлежность = "контрагента, связанного с физическим лицом";
				Принадлежность2 = "разных контрагентов связанных с физическим лицом";
			Иначе
				Принадлежность = "контрагента, связанного с юридическим лицом";
				Принадлежность2 = "разных контрагентов связанных с юридическим лицом";
			КонецЕсли;
			
			ПроверитьДанныеЮридическогоЛица(Данные, Принадлежность2);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Данные.КодРегиона) Тогда
			РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, Сущность, Принадлежность, Данные.КодРегиона,
															Данные.ЮридическиеФизическиеЛица, ДопустимыеДлиныОКАТОвФорме707);
		Иначе
			РеквизитыКонтрагента = "контрагента """ + Строка(Данные.Контрагент) + """ (Код: " + СокрЛП(Данные.КодКонтрагента) + ")";
			ОписаниеКонтрагента = СтрЗаменить(Принадлежность, "контрагента", РеквизитыКонтрагента);
			ОписаниеОшибки =  "У " + ОписаниеКонтрагента + " """ + Строка(Данные.ЮридическиеФизическиеЛица) + """ не указан код региона ...";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		
		ТекЮрФизЛицо = Данные.ЮридическиеФизическиеЛица;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеЮридическогоЛица(Данные, Принадлежность2)
	Если Данные.НеРезидент <> Данные.МинНеРезидент Тогда
		ОписаниеОшибки =  "Для " + Принадлежность2 + " " + Строка(Данные.ЮридическиеФизическиеЛица)
							+ " указаны разные сведения статусе нерезидента по документам ...";
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЕсли;
	Если Данные.РегионДляОтчетов <> Данные.МинРегионДляОтчетов Тогда
		ОписаниеОшибки =  "Для " + Принадлежность2 + " " + Строка(Данные.ЮридическиеФизическиеЛица) 
							+ " указаны разные коды регионов ...";
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьДанныеСчетовДепо(ДанныеСчетовДепо)
	Для каждого ДанныеСчетаДепо Из ДанныеСчетовДепо Цикл
		Если ДанныеСчетаДепо.ВидСчетаДляОтчета = "" Тогда
			ОписаниеОшибки = "У счета депо " + Строка(ДанныеСчетаДепо.СчетДепо)
							+ "( код:" + СокрЛП(ДанныеСчетаДепо.КодСчета) + ") не указан тип счета ...";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти
